magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_createInvoice_optional_shoppingCartCustomerAdd.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:shoppingCartCustomerSet soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
         <quoteId xsi:type="xsd:int">%s(createInvoiceOptionalQuoteId)</quoteId>
         <customer xsi:type="urn:shoppingCartCustomerEntity">
            <mode xsi:type="xsd:string">customer</mode>
			<customer_id>%s(moveProductFromQuoteToCartCustomerId)</customer_id>
         </customer>
         <storeId xsi:type="xsd:string">%s(storeId)</storeId>
      </urn:shoppingCartCustomerSet>
   </soapenv:Body>
</soapenv:Envelope>